// setInterval(() => {

//   console.log('ГОСПОДЕ ИСУСЕ ХРИСТЕ СИНЕ БОЖИЈИ ПОМИЛУЈ МЕ ГРЕШНОГА.  БОГОРОДИЦЕ ДЈЕВО РАДУЈ СЕ БЛАГОДАТНА МАРИЈО, БЛАГОСЛОВЕНА СИ ТИ МЕЂУ ЖЕНАМА И БАЛГОСЛОВЕН ЈЕ ПЛОД УТРОБЕ ТВОЈЕ. СЛАВА ГОСПОДУ!',)
//   console.log('ГОСПОДЕ ИСУСЕ ХРИСТЕ СИНЕ БОЖИЈИ ПОМИЛУЈ МЕ ГРЕШНОГА, БОГОРОДИЦЕ ДЈЕВО РАДУЈ СЕ БЛАГОДАТНА МАРИЈО, БЛАГОСЛОВЕНА СИ ТИ МЕЂУ ЖЕНАМА И БАЛГОСЛОВЕН ЈЕ ПЛОД УТРОБЕ ТВОЈЕ, СЛАВА ГОСПОДУ',)

// }, 9000)


//   setInterval(() => {
//       console.log('Јеванђеље Матеј, зачало 37. 10,23-31 23. А кад вас потерају у једном граду, бежите у други. Јер заиста вам кажем: Нећете обићи градова Израиљевих док не дође Син Човјечији. 24. Нема ученика изнад учитеља свога ни слуге изнад господара свога. 25. Доста је ученику да буде као учитељ његов и слуги као господар његов. Ако су домаћина назвали Веелзевулом, колико ће пре домаће његове? 26. Не бојте их се, дакле; јер нема ништа сакривено што се неће открити, ни тајно што се неће дознати. 27. Што вам говорим у тами, казујте на видику; и што вам се шапће на уши, проповедајте са кровова. 28. И не бојте се оних који убијају тело, а душу не могу убити; него се више бојте онога који може и душу и тело погубити у паклу. 29. Не продају ли се два врапца за један новчић? Па ни један од њих не падне на земљу без Оца вашега. 30. А вама је и коса на глави сва избројана. 31. Не бојте се, дакле; ви сте бољи од много врабаца.',)
//     }, 3990)

//   setInterval(() => {
//     console.log('Јеванђеље Лука, зачало 77. (14,25-35)25. Иђаше пак с њиме мноштво народа, и обазревши се рече им: 26. „Ако неко дође мени и не мрзи оца свог, и матер, и жену, и децу, и браћу, и сестре, па и живот свој, не може бити мој ученик. 27. И ко не носи крста свог и за мном не иде, не може бити мој ученик. 28. Јер ко од вас, кад хоће да зида кулу, не седне најпре да прорачуна издатке, да ли може довршити? 29. Да не би, кад постави темељ па не могне довршити, сви који гледају стали му се ругати. 30. Говорећи: Овај човек поче зидати, па не може да доврши. 31. Или који цар, кад пође у рат да се сукоби са другим царем, не седне најпре и не посавјетује се да ли је моћан срести са десет хиљада онога што иде на њега са двадесет хиљада? 32. Ако ли није, он пошаље изасланство док је онај још далеко и моли за мир. 33. Тако, дакле, сваки од вас који се не одрече свега што има, не може бити мој ученик. 34. Со је добра, али ако и со обљутави, чиме ће се осолити? 35. Није погодна ни за земљу ни за гнојиво, него је проспу напоље. Ко има уши да чује, нека чује!”, ')
//   }, 11779)

//   setInterval(() => {
//     console.log('БЛАЖЕН човек који не иде на веће безбожника,и на пут грешника не стаде,и на седалиште погубника не седе.Него је у закону Господњем воља његова,и у закону Његовом поучава се дан и ноћ.И биће као дрво засађено крај извора вода,које плод свој доноси у време своје,и лист његов неће отпасти,и све што ради преуспеће.Нису такви безбожници, нису такви,него су као прах који ветар размеће са лица земље.Зато неће устати безбожници на суду,нити грешници у сабору праведних.Јер зна Господ пут праведних,и пут безбожника пропашће.')
//   }, 11779)



//=====================================================
// for (let molitva = 1; molitva <= 10; molitva++) {
//  console.log(
//    `Богородице Дјево, радуј се благодатна Маријо, Господ је с Тобом; благословена си Ти међу женама, и
// блгословен је Плод утробе Твоје, јер си родила Спаситеља душа наших.${molitva}`
//  );
//  console.log(`ПОМИЛУЈ ме, Боже, по великој милости Својој,
//  и по обиљу милосрђа Свога очисти безакоње моје.
//  Опери ме добро од безакоња мога,
//  и од греха мога очисти ме.
//  Јер безакоње моје ја знам, и грех је мој стално преда мном.
//  Теби јединоме сагреших,
//  и зло пред Тобом учиних.
//  Да се оправдаш у речима Својим,[1]
//  и победиш када Ти суде.
//  Гле, у безакоњима се зачех,
//  и у гресима роди ме мати моја.
//  Гле, истину љубиш,
//  и јављаш ми непознатости и тајне мудрости Твоје.
//  Покропи ме исопом, и очистићу се;
//  опери ме, и бићу бељи од снега.
//  Дај ми да слушам радост и весеље,
//  да се обрадују кости потрвене.
//  Одврати лице Твоје од грехова мојих,
//  и сва безакоња моја очисти.
//  Срце чисто саздај у мени, Боже,
//  и Дух прав обнови у утроби мојој.
//  Не одбаци ме од лица Твога,
//  и Духа Твога Светога не одузми од мене.
//  Дај ми радост спасења Твога,
//  и Духом владалачким утврди ме.
//  Научићу безаконике путевима Твојим,
//  и безбожници ће се обратити к Теби.
//  Избави ме од крви, Боже, Боже спасења мога,
//  обрадоваће се језик мој правди Твојој.
//  Господе, отвори усне моје,
//  и уста моја казиваће хвалу Твоју.
//  Јер да си хтео жртве, ја бих Ти принео;
//  за жртве свеспаљенице не мариш.
//  Жртва је Богу дух скрушен;
//  срце скрушено и унижено Бог неће одбацити.
//  По благовољењу Своме, Господе, чини добро Сиону,
//  и нека се подигну зидови Јерусалимски.
//  Тада ћеш благоволити жртву правде,
//  приносе и жртве свеспаљенице,
//  тада ће принети на жртвеник Твој теоце.${molitva}`)
// 	}

// const contacts = [
//       {
//         firstName: "Akira",
//         lastName: "Laine",
//         number: "0543236543",
//         likes: ["Pizza", "Coding", "Brownie Points"],
//       },
//       {
//         firstName: "Harry",
//         lastName: "Potter",
//         number: "0994372684",
//         likes: ["Hogwarts", "Magic", "Hagrid"],
//       },
//       {
//         firstName: "Sherlock",
//         lastName: "Holmes",
//         number: "0487345643",
//         likes: ["Intriguing Cases", "Violin"],
//       },
//       {
//         firstName: "Kristian",
//         lastName: "Vos",
//         number: "unknown",
//         likes: ["JavaScript", "Gaming", "Foxes"],
//       },
//     ];

//     function lookUpProfile(name, prop) {
//       const contact = contacts.find((c) => c.firstName == name);

//       if  (!contact) return "No such contact!"

//       if (!contact[prop]) return "No such property!"

//       return contact[prop];
//     }

//     console.log(lookUpProfile("JavaSript", "Gaming"));

// function Rectangle(name, width, height) {
//   this.name = name;
//   this.width = width;
//   this.height = height;
// }

// const rect1 =  new Rectangle('Rectangle 1', 10, 10);

// console.log(rect1);


// =========================================
const rectangle = { 
  name: 'Rectangle 1',
  width: 10,
  height: 10,
  area: function () {
    return true;
  }
};

console.log(rectangle.area());