# from time import *
# print ("Subscribe")
# sleep(1)
# print("to")
# sleep(2)
# print("Nemanja")

# //

# from time import *
# print ("Оче наш, Који си на небесима,Да се свети име Твоје Да дође Царство Твоје, Да буде воља Твоја, и на земљи као и на небу, Хлеб наш насушни дај нам данас И опрости нам дугове наше као што и ми опраштамо дужницима својим И не уведи нас у искушење,Но избави нас од зла.")
# sleep(1)
# print("Јер је Твоје Царство, и сила, и слава Оца и Сина и Светога Духа, сада и увек и у векове векова.")
# sleep(2)
# print("Амин.")


# ================================multiline string
# print("""I am Iron Man.
# No, Iam Tony Stark.
# No, I am Poppy.""")



# from time import *
# print (""" Оче наш, Који си на небесима,
# 1. Да се свети име Твоје
# 2. Да дође Царство Твоје,
# 3. Да буде воља Твоја, и на земљи као и на небу.
# 4. Хлеб наш насушни дај нам данас;
# 5. И опрости нам дугове наше као што и ми опраштамо дужницима својим;
# 6. И не уведи нас у искушење,
# 7. Но избави нас од зла. """)
# sleep(1)
# print("""Јер је Твоје Царство, и сила, и слава Оца и Сина и Светога Духа, сада и увек и у векове векова. """)
# sleep(2)
# print("Амин.")

# # \n indicates new line ================== 

# print("I am Iron Man. \n" + "No, Iam Tony Stark .\n" + "No, I am Poppy.")

# print(""" Оче наш, Који си на небесима,
# 1. Да се свети име Твоје
# 2. Да дође Царство Твоје,
# 3. Да буде воља Твоја, и на земљи као и на небу.
# 4. Хлеб наш насушни дај нам данас;
# 5. И опрости нам дугове наше као што и ми опраштамо дужницима својим;
# 6. И не уведи нас у искушење,
# 7. Но избави нас од зла. """ * 100)


# print("Слава Теби Боже наш, слава Теби." * 10)

# print("Слава Теби Боже наш, слава Теби.\n" * 10)

# name  = "Nemanja"

# age = 31
# # age = "31"
# actual_age = 31.97

# # print(name)
# # print(age)

# # print(type(name))

# # print(type(age))

# # print(type(actual_age))

# print(5 + 7)

