# from time import *
# print ("Subscribe")
# sleep(1)
# print("to")
# sleep(2)
# print("Nemanja")

# //

from time import *
print ("Оче наш, Који си на небесима,Да се свети име Твоје Да дође Царство Твоје, Да буде воља Твоја, и на земљи као и на небу, Хлеб наш насушни дај нам данас И опрости нам дугове наше као што и ми опраштамо дужницима својим И не уведи нас у искушење,Но избави нас од зла.")
sleep(1)
print("Јер је Твоје Царство, и сила, и слава Оца и Сина и Светога Духа, сада и увек и у векове векова.")
sleep(2)
print("Амин.")

# print("I am Iron Man.
# No, Iam Tony Stark.
# No, I am Poppy.")

